{
    "format": "layers-model",
    "generatedBy": "keras v2.9.0",
    "convertedBy": "TensorFlow.js Converter v3.18.0",
    "modelTopology": {
        "keras_version": "2.9.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "model",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                4,
                                512,
                                1
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_1"
                        },
                        "name": "input_1",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "1_conv2D",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                4,
                                512,
                                1
                            ],
                            "dtype": "float32",
                            "filters": 8,
                            "kernel_size": [
                                1,
                                32
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "depthwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "depthwise_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "depthwise_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "1_conv2D",
                        "inbound_nodes": [
                            [
                                [
                                    "input_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization",
                        "inbound_nodes": [
                            [
                                [
                                    "1_conv2D",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "DepthwiseConv2D",
                        "config": {
                            "name": "1_depthConv2D",
                            "trainable": true,
                            "dtype": "float32",
                            "kernel_size": [
                                4,
                                1
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "depth_multiplier": 2,
                            "depthwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "depthwise_regularizer": null,
                            "depthwise_constraint": {
                                "class_name": "MaxNorm",
                                "config": {
                                    "max_value": 1.0,
                                    "axis": 0
                                }
                            }
                        },
                        "name": "1_depthConv2D",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_1",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_1",
                        "inbound_nodes": [
                            [
                                [
                                    "1_depthConv2D",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "elu"
                        },
                        "name": "activation",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "AveragePooling2D",
                        "config": {
                            "name": "average_pooling2d",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                1,
                                4
                            ],
                            "padding": "valid",
                            "strides": [
                                1,
                                4
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "average_pooling2d",
                        "inbound_nodes": [
                            [
                                [
                                    "activation",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.5,
                            "noise_shape": null,
                            "seed": null
                        },
                        "name": "dropout",
                        "inbound_nodes": [
                            [
                                [
                                    "average_pooling2d",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "SeparableConv2D",
                        "config": {
                            "name": "2_conv2D",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 16,
                            "kernel_size": [
                                1,
                                16
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "linear",
                            "use_bias": false,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {},
                                "shared_object_id": 24
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "depth_multiplier": 1,
                            "depthwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "pointwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "depthwise_regularizer": null,
                            "pointwise_regularizer": null,
                            "depthwise_constraint": null,
                            "pointwise_constraint": null
                        },
                        "name": "2_conv2D",
                        "inbound_nodes": [
                            [
                                [
                                    "dropout",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_2",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_2",
                        "inbound_nodes": [
                            [
                                [
                                    "2_conv2D",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_1",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "elu"
                        },
                        "name": "activation_1",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "AveragePooling2D",
                        "config": {
                            "name": "average_pooling2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                1,
                                8
                            ],
                            "padding": "valid",
                            "strides": [
                                1,
                                8
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "average_pooling2d_1",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_1",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.5,
                            "noise_shape": null,
                            "seed": null
                        },
                        "name": "dropout_1",
                        "inbound_nodes": [
                            [
                                [
                                    "average_pooling2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_3",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_3",
                        "inbound_nodes": [
                            [
                                [
                                    "dropout_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        },
                        "name": "flatten",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 3,
                            "activation": "linear",
                            "use_bias": true,
                            "depthwise_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "depthwise_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "depthwise_constraint": {
                                "class_name": "MaxNorm",
                                "config": {
                                    "max_value": 0.25,
                                    "axis": 0
                                }
                            },
                            "bias_constraint": null
                        },
                        "name": "dense",
                        "inbound_nodes": [
                            [
                                [
                                    "flatten",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "softmax",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "softmax"
                        },
                        "name": "softmax",
                        "inbound_nodes": [
                            [
                                [
                                    "dense",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input_1",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "softmax",
                        0,
                        0
                    ]
                ]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "accuracy",
                            "dtype": "float32",
                            "fn": "categorical_accuracy"
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 0.0010000000474974513,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "1_conv2D/kernel",
                    "shape": [
                        1,
                        32,
                        1,
                        8
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "1_depthConv2D/depthwise_kernel",
                    "shape": [
                        4,
                        1,
                        8,
                        2
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "2_conv2D/depthwise_kernel",
                    "shape": [
                        1,
                        16,
                        16,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "2_conv2D/pointwise_kernel",
                    "shape": [
                        1,
                        1,
                        16,
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization/gamma",
                    "shape": [
                        8
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization/beta",
                    "shape": [
                        8
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization/moving_mean",
                    "shape": [
                        8
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization/moving_variance",
                    "shape": [
                        8
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/gamma",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/beta",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/moving_mean",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/moving_variance",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_2/gamma",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_2/beta",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_2/moving_mean",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_2/moving_variance",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_3/gamma",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_3/beta",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_3/moving_mean",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_3/moving_variance",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/kernel",
                    "shape": [
                        256,
                        3
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/bias",
                    "shape": [
                        3
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}